sdaiCreateInstance(Sdai_instS*,Sdai_instS*)
\details
Creates an application instance within an associated model.
\param model [in] A model.
\param entity [in] An entity to be created.
\returns A created application instance represented with its pointer if it was created successfully; otherwise, the function returns a NULL pointer.
\code
SdaiModel model = ...;
SdaiEntity entCartesianPoint = sdaiGetEntity(model, "IfcCartesianPoint");
SdaiAppInstance cartesianPoint = sdaiCreateInstance(model, entCartesianPoint);
\remarks
The model should be accessed with the sdaiRW mode.